---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpotDimensionType
source: html/af6c9f3c-b40f-dbf9-743a-56c1ed745f69.htm
---
# SpotDimensionType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.